/*
(i) Код потрапляє у підсумковий файл,
тільки коли викликана функція,
наприклад flsFunctions.spollers();
Або коли імпортовано весь файл,
наприклад, import "files/script.js";
Невикористовуваний (не викликаний)
код у підсумковий файл не потрапляє.

Якщо ми хочемо додати модуль
слід його розкоментувати
*/

// Увімкнути/вимкнути FLS (Full Logging System) (в роботі)
window['FLS'] = false;

// Підключення основного файлу стилів
import "../scss/style.scss";

// ========================================================================================================================================================================================================================================================
// Функціонал ========================================================================================================================================================================================================================================================
// ========================================================================================================================================================================================================================================================
import * as flsFunctions from "./files/functions.js";

//Телефон і маска телефону
import { validatePhone } from './files/forms/inputmask.js';

/* Перевірка підтримки webp, додавання класу webp або no-webp для HTML */
/* (i) необхідно для коректного відображення webp із css */
flsFunctions.isWebp();
/* Додавання класу touch для HTML якщо браузер мобільний */
// flsFunctions.addTouchClass();
/* Додавання loaded для HTML після повного завантаження сторінки */
// flsFunctions.addLoadedClass();
/* Модуль для роботи з меню (Бургер) */
// flsFunctions.menuInit();
/* Враховування плаваючої панелі на мобільних пристроях при 100vh */
flsFunctions.fullVHfix();

/*
Модуль "Спойлери"
Сніппет (HTML): spollers
*/
// flsFunctions.spollers();

/*
Модуль "Таби"
Сніппет (HTML): tabs
*/
// flsFunctions.tabs();

/*
Модуль "Показати ще"
Сніппет (HTML): showmore
*/
// flsFunctions.showMore();


/*
Модуль "Кастомний курсор"
Документация:
Сниппет (HTML):
*/
// flsFunctions.customCursor(true);

/*
Модуль "Попапи"
Сніппет (HTML): pl, pop
*/
import './libs/popup.js'

/*
Модуль паралаксу мишею
*/
// import './libs/parallax-mouse.js'

// ========================================================================================================================================================================================================================================================
// Робота з формами ========================================================================================================================================================================================================================================================
// ========================================================================================================================================================================================================================================================
import * as flsForms from "./files/forms/forms.js";

/* Робота з полями форми */

flsForms.formFieldsInit({
	viewPass: false,
	autoHeight: false
});

/* Надсилання форми */
flsForms.formSubmit();

/* Модуль роботи з select. */
// import './libs/select.js'

/* Модуль роботи з масками.*/
validatePhone();
/*

*/

// ========================================================================================================================================================================================================================================================
// Модулі роботи з прокручуванням сторінки ========================================================================================================================================================================================================================================================
// ========================================================================================================================================================================================================================================================


// Ліниве (відкладене) завантаження картинок
// Документація плагіна: https://github.com/verlok/vanilla-lazyload
// Сніппет(HTML):
// import './files/scroll/lazyload.js';

// Спостерігач за об'єктами з атрибутом data-watch
// Сніппет(HTML):
// import './libs/watcher.js'

// Модуль поекранної прокрутки
// Сніппет(HTML):
// import './libs/fullpage.js'

// Модуль паралаксу
// Сніппет(HTML):
// import './libs/parallax.js'

// Функції роботи скролом
// import * as flsScroll from "./files/scroll/scroll.js";

// Плавна навігація по сторінці
// flsScroll.pageNavigation();

// Функціонал додавання класів до хедеру під час прокручування
// flsScroll.headerScroll();

// ========================================================================================================================================================================================================================================================
// Інші плагіни ============================================================================================================================================================================================================================================================================================================
// ========================================================================================================================================================================================================================================================

/* Динамічний адаптив */
// import "./libs/dynamic_adapt.js";

// ========================================================================================================================================================================================================================================================
// Інше ========================================================================================================================================================================================================================================================
// ========================================================================================================================================================================================================================================================
/* Підключаємо файли зі своїм кодом */
import "./files/script.js";
import "./files/sliders.js";
import "./files/stiky-block.js";
import "./files/progress-bar.js";
//============================================================================================================================================================================================================================================